zephyrproject-rtos/zephyr/include/zephyr/dt-bindings/clock/hc32f4a0_clock.h
/*
 * Copyright (C) 2024-2025, Xiaohua Semiconductor Co., Ltd.
 *
 * SPDX-License-Identifier: Apache-2.0
 */

#ifndef ZEPHYR_INCLUDE_DT_BINDINGS_CLOCK_HC32F4A0_CLOCK_H_
#define ZEPHYR_INCLUDE_DT_BINDINGS_CLOCK_HC32F4A0_CLOCK_H_

#include "hc32f4_common_clock.h"

#define HC32_FCG0_PERIPH_SRAMH 0
#define HC32_FCG0_PERIPH_SRAM1 4
#define HC32_FCG0_PERIPH_SRAM2 5
#define HC32_FCG0_PERIPH_SRAM3 6
#define HC32_FCG0_PERIPH_SRAM4 7
#define HC32_FCG0_PERIPH_SRAMB 10
#define HC32_FCG0_PERIPH_KEY   13
#define HC32_FCG0_PERIPH_DMA1  14
#define HC32_FCG0_PERIPH_DMA2  15
#define HC32_FCG0_PERIPH_FCM   16
#define HC32_FCG0_PERIPH_AOS   17
#define HC32_FCG0_PERIPH_CTC   18
#define HC32_FCG0_PERIPH_MAU   19
#define HC32_FCG0_PERIPH_AES   20
#define HC32_FCG0_PERIPH_HASH  21
#define HC32_FCG0_PERIPH_TRNG  22
#define HC32_FCG0_PERIPH_CRC   23
#define HC32_FCG0_PERIPH_DCU1  24
#define HC32_FCG0_PERIPH_DCU2  25
#define HC32_FCG0_PERIPH_DCU3  26
#define HC32_FCG0_PERIPH_DCU4  27
#define HC32_FCG0_PERIPH_DCU5  28
#define HC32_FCG0_PERIPH_DCU6  29
#define HC32_FCG0_PERIPH_DCU7  30
#define HC32_FCG0_PERIPH_DCU8  31

#define HC32_FCG1_PERIPH_CAN1   0
#define HC32_FCG1_PERIPH_CAN2   1
#define HC32_FCG1_PERIPH_ETHMAC 2
#define HC32_FCG1_PERIPH_QSPI   3
#define HC32_FCG1_PERIPH_I2C1   4
#define HC32_FCG1_PERIPH_I2C2   5
#define HC32_FCG1_PERIPH_I2C3   6
#define HC32_FCG1_PERIPH_I2C4   7
#define HC32_FCG1_PERIPH_I2C5   8
#define HC32_FCG1_PERIPH_I2C6   9
#define HC32_FCG1_PERIPH_SDIOC1 10
#define HC32_FCG1_PERIPH_SDIOC2 11
#define HC32_FCG1_PERIPH_I2S1   12
#define HC32_FCG1_PERIPH_I2S2   13
#define HC32_FCG1_PERIPH_I2S3   14
#define HC32_FCG1_PERIPH_I2S4   15
#define HC32_FCG1_PERIPH_SPI1   16
#define HC32_FCG1_PERIPH_SPI2   17
#define HC32_FCG1_PERIPH_SPI3   18
#define HC32_FCG1_PERIPH_SPI4   19
#define HC32_FCG1_PERIPH_SPI5   20
#define HC32_FCG1_PERIPH_SPI6   21
#define HC32_FCG1_PERIPH_USBFS  22
#define HC32_FCG1_PERIPH_USBHS  23
#define HC32_FCG1_PERIPH_FMAC1  24
#define HC32_FCG1_PERIPH_FMAC2  25
#define HC32_FCG1_PERIPH_FMAC3  26
#define HC32_FCG1_PERIPH_FMAC4  27

#define HC32_FCG2_PERIPH_TMR6_1  0
#define HC32_FCG2_PERIPH_TMR6_2  1
#define HC32_FCG2_PERIPH_TMR6_3  2
#define HC32_FCG2_PERIPH_TMR6_4  3
#define HC32_FCG2_PERIPH_TMR6_5  4
#define HC32_FCG2_PERIPH_TMR6_6  5
#define HC32_FCG2_PERIPH_TMR6_7  6
#define HC32_FCG2_PERIPH_TMR6_8  7
#define HC32_FCG2_PERIPH_TMR4_1  8
#define HC32_FCG2_PERIPH_TMR4_2  9
#define HC32_FCG2_PERIPH_TMR4_3  10
#define HC32_FCG2_PERIPH_HRPWM   11
#define HC32_FCG2_PERIPH_TMR0_1  12
#define HC32_FCG2_PERIPH_TMR0_2  13
#define HC32_FCG2_PERIPH_EMB     15
#define HC32_FCG2_PERIPH_TMR2_1  16
#define HC32_FCG2_PERIPH_TMR2_2  17
#define HC32_FCG2_PERIPH_TMR2_3  18
#define HC32_FCG2_PERIPH_TMR2_4  19
#define HC32_FCG2_PERIPH_TMRA_1  20
#define HC32_FCG2_PERIPH_TMRA_2  21
#define HC32_FCG2_PERIPH_TMRA_3  22
#define HC32_FCG2_PERIPH_TMRA_4  23
#define HC32_FCG2_PERIPH_TMRA_5  24
#define HC32_FCG2_PERIPH_TMRA_6  25
#define HC32_FCG2_PERIPH_TMRA_7  26
#define HC32_FCG2_PERIPH_TMRA_8  27
#define HC32_FCG2_PERIPH_TMRA_9  28
#define HC32_FCG2_PERIPH_TMRA_10 29
#define HC32_FCG2_PERIPH_TMRA_11 30
#define HC32_FCG2_PERIPH_TMRA_12 31

#define HC32_FCG3_PERIPH_ADC1     0
#define HC32_FCG3_PERIPH_ADC2     1
#define HC32_FCG3_PERIPH_ADC3     2
#define HC32_FCG3_PERIPH_CMBIAS   3
#define HC32_FCG3_PERIPH_DAC1     4
#define HC32_FCG3_PERIPH_DAC2     5
#define HC32_FCG3_PERIPH_CMP12    8
#define HC32_FCG3_PERIPH_CMP34    9
#define HC32_FCG3_PERIPH_OTS      12
#define HC32_FCG3_PERIPH_DVP      15
#define HC32_FCG3_PERIPH_EXMC_SMC 16
#define HC32_FCG3_PERIPH_EXMC_DMC 17
#define HC32_FCG3_PERIPH_EXMC_NMC 18
#define HC32_FCG3_PERIPH_USART1   20
#define HC32_FCG3_PERIPH_USART2   21
#define HC32_FCG3_PERIPH_USART3   22
#define HC32_FCG3_PERIPH_USART4   23
#define HC32_FCG3_PERIPH_USART5   24
#define HC32_FCG3_PERIPH_USART6   25
#define HC32_FCG3_PERIPH_USART7   26
#define HC32_FCG3_PERIPH_USART8   27
#define HC32_FCG3_PERIPH_USART9   28
#define HC32_FCG3_PERIPH_USART10  29

#define HC32_CLK_CONF_USB (4)
#define HC32_CLK_CONF_I2S (5)
#define HC32_CLK_CONF_CAN (6)
#define HC32_CLK_CONF_MAX HC32_CLK_CONF_CAN
#endif /* ZEPHYR_INCLUDE_DT_BINDINGS_CLOCK_HC32F4A0_CLOCK_H_ */
